{"singlePage": [], "startSite": "", "filingNum": "", "onePageListNum": 15, "commentLabelColor": "#006b75", "yearColorList": ["#bc4c00", "#0969da", "#1f883d", "#A333D0"], "i18n": "CN", "themeMode": "manual", "dayTheme": "light", "nightTheme": "dark", "urlMode": "pinyin", "script": "", "style": "", "head": "", "indexScript": "", "indexStyle": "", "bottomText": "", "showPostSource": 1, "iconList": {}, "UTC": 8, "rssSplit": "sentence", "exlink": {}, "needComment": 1, "allHead": "", "title": "Yichiban's Go", "subTitle": "ユリイカ", "avatarUrl": "https://avatars.githubusercontent.com/u/160466378?v=4", "GMEEK_VERSION": "last", "postListJson": {"P4": {"htmlDir": "docs/post/SCAVERGER HUNT 25-JULY.html", "labels": ["blog"], "postTitle": "SCAVERGER HUNT 25/JULY", "postUrl": "post/SCAVERGER%20HUNT%2025-JULY.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/4", "commentNum": 0, "wordCount": 636, "description": "On Monday, Julie, Fiona and I went scavenger hunting in the school with clues and maps. It was not easy becasue there were many things I couldn’t understand, and things I could’t find.\n\n![image](https://github.com/user-attachments/assets/a55348f3-d0bc-4a4c-8c34-1b611a7b8328)\n\nGOLDEN GLOBE ATOP A TOWER OF EIGHTS.\n\njulie found it not me,well i guess she’s much better than me unless at this part.\n\n![image](https://github.com/user-attachments/assets/030e303f-93f3-4138-a1ec-34c358c6e1c8)\n\nHE DISEMBODIED HANDS OF A GREAT APE.\n\nIt was easy to found, Cause I with their team so I found it but why is there a gorilla’s hand in the school ?。", "top": 0, "createdAt": 1723121500, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-08-08", "dateLabelColor": "#bc4c00"}, "P6": {"htmlDir": "docs/post/Homework Tasks - Week 1, Session 2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 1, Session 2", "postUrl": "post/Homework%20Tasks%20-%20Week%201%2C%20Session%202.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/6", "commentNum": 0, "wordCount": 804, "description": "https://youtu.be/7ynDcNB4T9g?si=CB2Z5z2P4Ad-q1JM\n\nHow successful I feel \n\nI think the success rate is about 30%. I took the video of the scenery on the tram. I used to live in the suburbs, so I was far away from the school. So I didn't know what to take a video of, so I took a video of the scenery outside the tram windows.\n\nDoria took a video of the state library and Julie took a video of her desk at home.\n\nSome brief reflections on that process\n\nI think the videos I shoot are boring, only the scenery. Maybe I need something more interesting. This requires me to learn editing skills like other video bloggers.\n\nAiming for\n\nI hope that one day I can learn more practical skills so that one day I can watch more of my own videos at least I won’t be bored. But I’m lazy so I hope I can do it one day.。", "top": 0, "createdAt": 1723352129, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-08-11", "dateLabelColor": "#bc4c00"}, "P7": {"htmlDir": "docs/post/Homework Tasks -Week 2, Session 1.html", "labels": ["blog"], "postTitle": "Homework Tasks -Week 2, Session 1", "postUrl": "post/Homework%20Tasks%20-Week%202%2C%20Session%201.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/7", "commentNum": 0, "wordCount": 1788, "description": "![image](https://github.com/user-attachments/assets/201a6e0e-e47f-4325-9513-2097feb6c519)\n\nThe first shot is from the shoes in the crowd, switching to my shoes, In my opinion, this is a kind of continuity. For example, the pen in my hand when the pen fall the light turns green.\n\n![image](https://github.com/user-attachments/assets/b7919596-aa6e-4d4a-90ba-448f4bfaa5b4)\n\nWhen the green light comes out, I write something in my notebook and then connect with some conceptual stuff.\n\n![image](https://github.com/user-attachments/assets/5b6cd667-aa65-4242-8763-85a2074fd722)\n\nThe third picture I wanted to express a sense of discontinuity, similar to a jump cut, but the final result might not be very good. The content is mainly about me going out.\n\n![image](https://github.com/user-attachments/assets/69270626-cb47-46ea-a08a-5a75d58f7fa9)\n\nThe fourth photo shows my hobbies: playing chess, cooking, and drinking mate. I also occasionally go out for a walk. I hope to show a calm emotion, so the movements are usually fixed or the movements are relatively small.\n\nQuestion:The editing method influences the main themes, concepts, actions and feelings I want to present to the viewer ?\n\nAnswer: I want to give people a sense of calmness, so the movements are not big during the shooting. But in the middle part, I want to show the dynamics, so I want to create a sense of discontinuity. At other times, I basically hope that the video editing is logical, that is, to maintain coherence. There are also some conceptual things, such as green plants and sunshine. I hope there is a meaning in them, perhaps growth or simply to tell the viewer that it is dawn.\n\n(Sorry, professor, if you see this, I need to say sorry because my storyboard is really bad I'm not used to drawing on the computer.)。", "top": 0, "createdAt": 1723370171, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-08-11", "dateLabelColor": "#bc4c00"}, "P8": {"htmlDir": "docs/post/Homework Tasks - Week 2, Session 2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 2, Session 2", "postUrl": "post/Homework%20Tasks%20-%20Week%202%2C%20Session%202.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/8", "commentNum": 0, "wordCount": 2265, "description": "Question: Key moments in the two-minute video ?\n\nAnswer: As the creator of this video, I like the beginning and the end of this video. If I have to choose, I would choose the end because if possible, I hope that the viewers will think that this is an interesting idea when they see the end.\n\nQuestion: How I planing to use Sound design and soundtrack to construct this moment ?\n\nAnswer: At the end I took videos of the lake, the temple, the flowing water and finally I wrote down my expectations for the future.\n\nSo these are all calm shots. I used ambient sounds and slow guitars to create a balance between the audio and visual elements. The sound of water, wind, and the sound of a book closing are all elements.\n\nQuestion: Emotional tone How editing will support that tone?\n\nAnswer: The coherent editing and emotional tone are what I want to present. I hope that people who watch my video will at least feel relaxed when watching my video, so I don’t want the ending to be illogical, so I hope that there won’t be any particularly fast-cut editing at the end.\n\nQuestion: The relationship between the shots I want to establish?\n\nAnswer: For me, the relationship between shots is important. If the continuity of the shots is disrupted, the video will feel weird. So I hope that each shot or the next shot is logical and does not make people feel out of place.\n\nQuestion: Trying to establish the rhythm beat speed editing how to produce this effect?\n\nAnswer: At the end, I hope to make a fade-out with the I close the book, and there is also the sound of running water. I want to make a G cut. I hope the ambient sound can give people a feeling of comfort and texture.\n\n![image](https://github.com/user-attachments/assets/7a76838e-8039-46b4-b9ff-f57285bb04c4)\n\nThe first shot of the hand lying on the bench by the sea with ambient sound and background music.\n\nThe second shot is the sound of returning home and throwing keys on the table.\n\nThe third shot is the sound of brewing yerba mate tea and background music.\n\nThe fourth shot Go game ambient sound and fade-in.\n\nThe fifth shot is the sound of cooking and background music.\n\nThe sixth one I put my hands together 🙏 There is no ambient sound because it is too noisy outside, so there is only background music.。", "top": 0, "createdAt": 1723373715, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-08-11", "dateLabelColor": "#bc4c00"}, "P9": {"htmlDir": "docs/post/Homework Tasks - Week 3, Session1.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 3, Session1", "postUrl": "post/Homework%20Tasks%20-%20Week%203%2C%20Session1.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/9", "commentNum": 0, "wordCount": 2163, "description": "https://youtu.be/4TGwaPqWTDU?si=32F9rQJ3qKRgZEer\n\nThe process of making a draft\n\nI thought of many ideas, such as using the changes in the shadow 👥 under the light to introduce myself, treating the doll 🧸 as myself and only shooting the doll, and only shooting the back of my head in the video, but to be honest, these are a bit difficult for me to shoot alone because I am alone.\n\nFinally, I chose to shoot my hands and feet to express the changes and movements of the hands in different scenes. This is actually more difficult than I thought. How to express the natural movements of the hands and how to express the changes of light and shadow on the hands?\n\n![image](https://github.com/user-attachments/assets/b6fd8b10-b95c-4e94-ad32-05e095ffb566)\n\nOf course, it is best to present it naturally, but I have to put the phone in a stable position to shoot. I actually have a lot of things I want to present, but it is difficult for me to do it at this stage. Just like the directors in the movies, they can shoot the hands like ballet dancers, so the movement of the hands is a problem for me.\n\n![image](https://github.com/user-attachments/assets/ff0f7e2c-b0a0-4094-b519-cfa59349af39)\n\nThe topic of hands is also very interesting to me because I remember that AI-made paintings and videos often make mistakes on hands. Michelangelo's oil painting Creation of Eve, Adam's outstretched fingers represent what it means to me is a beginning and a connection, so I hope that my hands in the video can also have a meaning, just like a fist 👊 can represent courage and anger, the hands I present in the video are more like representing myself, my emotions, and my feelings.\n\n![image](https://github.com/user-attachments/assets/ef77b095-c11e-46da-9b2f-4cdced69020c)\n\nAnd this is Dürer's Praying Hands 🙏 A very important painting in art history. When I was writing this article ✍️, I suddenly thought of this painting. I guess this painting can better represent my thoughts.\n\n（Professor, if you can see this, I would really appreciate it🙏 I wrote too much and my writing is not good. Only text looks too boring, so I added some emojis. Thank You Again for your patience.）。", "top": 0, "createdAt": 1723376529, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-08-11", "dateLabelColor": "#bc4c00"}, "P10": {"htmlDir": "docs/post/Supplement to scavenger hunt.html", "labels": ["blog"], "postTitle": "Supplement to scavenger hunt", "postUrl": "post/Supplement%20to%20scavenger%20hunt.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/10", "commentNum": 0, "wordCount": 837, "description": "I wrote in my scavenger hunt blog that our group didn't find much so I later went looking for some more items like those on the list.\n\n![image](https://github.com/user-attachments/assets/a24abf29-d262-4bc0-a922-e2d6d968d55b)\n\nprobably An explosive cup of coffee.\n\n![image](https://github.com/user-attachments/assets/7e97abfc-0587-4c20-9bee-6c408db7addc)\n\nWooden things like statues or cloaks probably A curtain of roots\n, delivered by a winged visitor.\n\n![image](https://github.com/user-attachments/assets/7e44c9fe-ad09-4fd9-ab29-00df05829936)\n\nA book containing Digital Media wisdom, found amongst many.\n\n![image](https://github.com/user-attachments/assets/e2aeaa44-1e4b-4afc-b7ee-2dda33027433)\n\nA study space fit for a Sith Lord \n\n(About selfies🤳My group and I tried it before but the photos were ugly so we gave up. Sorry about that.)。", "top": 0, "createdAt": 1723377787, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-08-11", "dateLabelColor": "#bc4c00"}, "P11": {"htmlDir": "docs/post/Homework Tasks-Week 4, Session 1.html", "labels": ["blog"], "postTitle": "Homework Tasks-Week 4, Session 1", "postUrl": "post/Homework%20Tasks-Week%204%2C%20Session%201.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/11", "commentNum": 0, "wordCount": 2544, "description": "Black Square Activity \n\n![image](https://github.com/user-attachments/assets/262636f3-cd22-42d2-852a-6bf0092b715b)\n\nAs a student who is new to illustrator, I think I will use shape tools, pen tool, path editing, alignment and distribution, color and gradient, transparency and blending modes in my work.\n\nDesign Thinking\n\nEmpathize\n• Gather data and collect  data :gather user expectations and feedback on icons through interviews, questionnaires, or observations.\n👍\nDefine \n• Problem definition: Based on the information collected, identify the core problem that needs to be solved when designing the icon.\n👍\nIdeate\n• Mind Mapping: Use mind maps to organize and expand ideas and explore different design directions.\n👍\nPrototype\n• Rapid prototyping: Create preliminary sketches or digital prototypes of your icon design.\n👍\nTest\n• Functionality testing: Ensure the functionality and usability of icons on different devices and platforms.\n👍\nImplement\n• Final design: Complete the final icon design based on the test results.\n\n![image](https://github.com/user-attachments/assets/01400989-883b-4184-bace-372f7ede5b93)\n\n![image](https://github.com/user-attachments/assets/5a1a4022-fd4f-4fac-b153-8603e855e0c8)\n\n\nI originally had three ideas. The PlayStation system icon has simple lines that can tell the user what the icon is used for. I also thought of an icon for the weather app, but there are only a few types of weather, such as sunny, rainy, snowy, cloudy, etc. The other one is a game icon. I actually like this idea very much. I even drew a rough sketch. But recently I tried it and found that it is too difficult for me to challenge the game icon at my current level.\n\nSo recently I thought of social networking apps. Actually I think this is not bad. We use it almost every day. Think about the billions of people who use social networking apps in the world. What a huge user group. As for why I chose this theme, system, I think we use these apps every day, but when we are used to using it, we will forget about these icons and just rely on our subconscious to react to them. So I think you must be an excellent designer👨‍🎨to be able to make this feeling. Different functions in the app can become icons, so I want to design icons for it. The specific platform is the mobile phone. The background is some basic functions. The audience on the social networking app I hope is everyone, regardless of gender, age or young, but I hope the icon design is a little more interesting, so it may also be more inclined to a slightly younger group.。", "top": 0, "createdAt": 1724064840, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-08-19", "dateLabelColor": "#bc4c00"}, "P12": {"htmlDir": "docs/post/Homework Tasks - Week 4, Session 2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 4, Session 2", "postUrl": "post/Homework%20Tasks%20-%20Week%204%2C%20Session%202.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/12", "commentNum": 0, "wordCount": 3987, "description": "Thumbnail Sketching Activity\r\nThis is the yerba mate🧉cup I drew\r\n\r\nI like the second bird's-eye view. You can see the tea straws in the cup like pillars falling from the sky. It's very simple and the effect looks ok.\r\n\r\n ![image](https://github.com/user-attachments/assets/a6f5d8bf-ac08-4edf-a588-0d71e9e636a1)\r\n\r\nSketch of the icon created for assignment 2\r\n\r\n'Icons are a powerful form communication that can cross cultural and language barriers'(From slideshows)\n\nI remember Elon Musk said at a blog summit two years ago that he hoped to use WeChat as a template to transform Twitter.(I don't know if this is true or false🤔)\n\nTo make a long story short, he felt that there was no such a unified application as WeChat in my hometown. You can post comments on WeChat, publish videos, and earn revenue from content creation.（WeChat is more like WhatsApp plus PayPal plus Instagram plus Twitter As of the end of the third quarter of 2023, WeChat's monthly active users reached 1.336 billion）\n\nFor the whole set of icons, I hope to give people a friendly feeling, so I will avoid making icons with edges and corners. Icons with arcs or round shapes will be better.\n\nAt the same time, texture is also what I want to emphasize. After all, it is a great thing🤩to be able to express the texture of an icon through the screen.\n\n![image](https://github.com/user-attachments/assets/d3101445-ed8d-4a04-8fb9-c8eb3035124c)\n\nRegarding file backup, many companies also like to use the cloud. Maybe they want users to think that their backups are in the cloud☁️, so they are safer. So I hope to clearly describe the feeling of uploading and downloading. In the end, I may choose the one with the upload symbol☝️.\n\nRegarding searching, I have looked for some inspirations online or simply looked at the designs of some companies, but most of them are magnifying glasses🔍, which is a bit boring. And I can't think of a particularly good alternative🕵️‍♂️. So I might replace it in the end. Maybe it would be nice to make a folder icon to go with the file back up.\n\nIf possible, I would like to use horizontal lines for the contact icon because it gives people a sense of stability. The contact icon should contain our relatives and friends, so if possible, avoiding overly square lines is also an option. It is also good to have some arcs or give some round feeling. I may choose the first icon.\n\nThe collection icon contains things we like or find useful, so it can be interpreted as a desire for knowledge. Vertical lines can be a kind of usage element. Its characteristic is demanding of attention. After all, we will definitely look for the content again after we collect🌟it. I might do the first one.\n\nRegarding information icons, the first thing that comes to my mind is diagonal lines because it is energetic, implying impending change. We always have expectations and uneasiness about unknown news, so diagonal is a good choice. I might make it the fifth one.\n\nRegarding the album icon, there are many styles when I was looking for it, such as a colorful windmill with a certain degree of transparency and a simple landscape outlined by lines. I want to use straight lines and some curves to depict the mountains. There is a small🗻hill behind the mountain with a sense of🌆sunset, and maybe a small sun on it.\n\n![image](https://github.com/user-attachments/assets/6c814eb0-4a8c-465c-bca2-d2513944c405)\n\nThe discover icon is essentially to check the latest updates from friends, so there are many things that can represent the🧭compass and the mysterious📦box. However, I want to use a curve to draw the planet icon because it gives people a feeling of exploring in space, and it would be best if it has a ring like Saturn🪐, so I should choose the fourth one.\n\nRegarding wallets, I think the most commonly used👝wallet is the best representation. A slight curve can bring a sense of calm to the wallet icon. After all, everyone hopes that the money in their wallet is💳safe. I might choose the fifth one.。", "top": 0, "createdAt": 1724317612, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-08-22", "dateLabelColor": "#bc4c00"}, "P13": {"htmlDir": "docs/post/Homework Tasks - Week 5, Session 1.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 5, Session 1", "postUrl": "post/Homework%20Tasks%20-%20Week%205%2C%20Session%201.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/13", "commentNum": 0, "wordCount": 933, "description": "4 Icons with 16 total colour variations.\n\n![image](https://github.com/user-attachments/assets/29587fc3-82cc-4718-b2d4-c572c0b75e60)\n\n![image](https://github.com/user-attachments/assets/297d0137-c6c0-4434-b7f9-0c0bb4a8b263)\n\n![image](https://github.com/user-attachments/assets/3caf7394-9943-4f4a-aa25-a3e8e14c76aa)\n\n![image](https://github.com/user-attachments/assets/a53f4a9d-076c-428b-9967-8bbfa3631722)\n\nI prefer the color scheme of Monochromatic because the keyword of the theme I want to design is system.\n\nMy goal was to design a set of icons that were consistent, simple, and focused on functionality, so the Monochromatic color scheme was a great choice. It maintains the overall harmony of the design while helping users focus on the meaning and functionality of the icons.\n\nFinally, I think the mono chromatic color scheme is very easy to maintain consistency and it also makes it easier for me to do subsequent icon design.。", "top": 0, "createdAt": 1725191793, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-09-01", "dateLabelColor": "#bc4c00"}, "P14": {"htmlDir": "docs/post/Homework Tasks - Week 5, Session 2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 5, Session 2", "postUrl": "post/Homework%20Tasks%20-%20Week%205%2C%20Session%202.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/14", "commentNum": 0, "wordCount": 1427, "description": "Revisit the platform, context, and audience that you initially identified for your icons ?\n\nFor the platform of the icon, my keyword is system. Then I give it the context of social networking app. After all, most people use this kind of software on mobile phones. So for the platform, I chose mobile phones, including iOS and Android.\n\n\nThe design background of the icon. I hope it is modern and simple. In the early days of mobile phones, icons usually appeared in a realistic way. So I think it is a good idea to use simple lines to depict the shape of objects and add some lively colors.\n\n![image](https://github.com/user-attachments/assets/d90f7870-7357-431a-8423-62af97ba0d05)\n\nI hope that the audience of icons should be very broad, including teenagers to middle-aged users. In order to attract and adapt to such a wide user group, icons need to have a certain degree of universality and ease of use. Therefore, moderate skeuomorphism is also necessary for icons. Users need to accurately and quickly understand the meaning of each icon.\n\n![image](https://github.com/user-attachments/assets/06d309c7-7549-41b2-b16d-3ae394fcbc50)\n\n![image](https://github.com/user-attachments/assets/4a6008fe-77f0-47cc-a1eb-431bb227d5ca)\n\nExperiment with swapping out the existing images in the template with your own prototype icon designs\n\nsorry😢about this professor , I still don't understand a lot of things so the result is pretty bad。", "top": 0, "createdAt": 1725194289, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-09-01", "dateLabelColor": "#bc4c00"}, "P15": {"htmlDir": "docs/post/Homework Tasks - Week 6, Session 1.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 6, Session 1", "postUrl": "post/Homework%20Tasks%20-%20Week%206%2C%20Session%201.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/15", "commentNum": 0, "wordCount": 1787, "description": "Remember to document your process and design decisions on your blog as you go,\n\nAbout the design process and design decisions\n\nMy first step is to analyze the needs Thinking about what basic and additional features the user groups and audiences need and how to present them is like🤔thinking about the visual preferences of most people.\n\nAfter that, it was concept development. Based on the needs analysis, after thinking about the overall style of the icons, I decided to adopt a simple and modern design to ensure that the icons are clearly identifiable under different backgrounds and conform to the overall aesthetic of the system application theme. There is also a basic color scheme. I decided to use gradient colors and soft color schemes to create a sense of depth visually while avoiding too strong color contrast to ensure that the entire set of icons can be harmoniously integrated into the interface.\n\n![image](https://github.com/user-attachments/assets/b3ebf9ef-f329-43d0-9c81-14e7740698e3)\n（Just like this feeling, I also searched a lot on the Internet）\n\nAfter that comes the preliminary design, which I sketch in my notebook to make sure the icons are visually consistent and convey their respective functions.\n\nThen the detailed design is to further refine the details of the icon. The gradient shadow and semi-transparent effect are used to make the icon still have a three-dimensional feeling in the case of flat style, and it can also be differentiated from other similar social networking icons.\n\nFinally, there is the final confirmation test and optimization. At that time, I will review my own icon and think about what to do for the icon at this time. Should I adjust the thickness of the line or reduce useless details? I will try to adjust it when the time comes.。", "top": 0, "createdAt": 1725196083, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-09-01", "dateLabelColor": "#bc4c00"}, "P16": {"htmlDir": "docs/post/Homework Tasks - Week 6, Session 2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 6, Session 2", "postUrl": "post/Homework%20Tasks%20-%20Week%206%2C%20Session%202.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/16", "commentNum": 0, "wordCount": 1613, "description": "Review the homework tasks and blog entries that you have produced so far.\n\nSpeaking of the final adjustments, I didn’t actually finish in the last blog post. Mainly because I haven’t reached the final stage yet, so I’ll write a little more now.\n\nIn the final stage I make sure the icons can be displayed on the website and do a consistency check on the entire icon set to ensure that all icons are consistent in style, color, line thickness, etc.\n\n_ Design Decisions_\n\n• Functionality first: Consider the functionality of the icon first and ensure that each icon can intuitively express its corresponding function.\n\n• Visual harmony: Use a consistent style and color scheme to ensure that the icon set blends seamlessly with the rest of the system or app.\n\n![image](https://github.com/user-attachments/assets/d5726472-0089-4c61-87ec-8d793c236fe3)\n（still Google hahaha But I think this can be used as an example of icon style unification）\n\n• User experience: Pay attention to the readability of icons on different devices and backgrounds to ensure that users can quickly recognize and use these icons regardless of the usage scenario.\n\nSummarize:\n\nI wanted to make specific design decisions every step of the way to ensure the icon set had the best balance between functionality, visuals, and user experience.\n\n（I wanted to add some sense of space and distance to the flat design icon, so I used gradients and transparency to make it look less😆boring and like other icons. In the final stage, I reduced the shadow so I hope🙏it is still within the scope of flat design.）\n\nThank you for reading my blog, Professor🙏🙏🙏。", "top": 0, "createdAt": 1725198016, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-09-01", "dateLabelColor": "#bc4c00"}, "P17": {"htmlDir": "docs/post/Homework Tasks - Week 7, Session 1.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 7, Session 1", "postUrl": "post/Homework%20Tasks%20-%20Week%207%2C%20Session%201.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/17", "commentNum": 0, "wordCount": 1453, "description": "Assignment 3 feels a bit difficult since this is the first time to do something in a 3D environment.\n\n![image](https://github.com/user-attachments/assets/a491469f-b087-4f89-9d81-abea81bef1dd)\n\nThis is the class activity first try, hope I can do better in the future\n\n__About personal transformation\n\nI think this is the hardest part because it is always hard for me to choose The transformation and the environment, how to blend them together to make a good concept is definitely the most difficult thing to express in the third stage.\n\nThink of three transformations in class: big, medium and small\n\nI think the biggest one is the two years I spent in Italy. I basically spent 17 to 18 years there. I went through a lot of changes in those two years. I first lived in a small Italian town with a population of only 20,000 people for a year.\n\nSmall transformation I think it was the movie Chungking Express and some black and white movies. Since then, I have become interested in the filming techniques and stories of movies.\n\nI haven't figured out the medium transformation yet.\n\nI hope the material can give a certain sense of reality and let people feel the texture.\n\nI hope to use the sounds that we are familiar with in our daily lives, such as the sound of wind and grass, to give people a sense of harmony.\n\nI also made a small sketch for this map of mine\n\n![image](https://github.com/user-attachments/assets/cc92819f-a933-402f-9a82-eb0eae1aac9d)。", "top": 0, "createdAt": 1725890591, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-09-09", "dateLabelColor": "#bc4c00"}, "P18": {"htmlDir": "docs/post/Homework Tasks - Week 7, Session 2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 7, Session 2", "postUrl": "post/Homework%20Tasks%20-%20Week%207%2C%20Session%202.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/18", "commentNum": 0, "wordCount": 2346, "description": "For assignment 3, my final choice should be Akira Kurosawa's movie Ran. （Akira Kurosawa shot four unique color films）\r\n\r\n![屏幕截图 2024-10-03 220454](https://github.com/user-attachments/assets/34c690ce-5e55-4fd4-a60c-6ac66fe0fca4)\r\n\r\nKurosawa's movies actually gave me a lot of inspiration. When I was in junior high school, I actually liked watching movies. At first, it was Hollywood special effects movies, then art films, and then black-and-white movies. The first black-and-white movie I watched was actually Sergio Leone's A Fistful of Dollars (Italian: Per un pugno di dollari). When I finished watching it, I felt that black-and-white movies were actually quite good, not as boring as I thought. Then I saw some comments on the Internet saying that this movie was actually plagiarized from Kurosawa's Yojimbo (Japanese: 用心棒,). So these movies reshaped my view of them.\r\n\r\n_ “Creation is equivalent to memory. Creation is produced from memory and cannot be created out of nothing”_\n\nI think these big and small things have also changed me from beginning to end. I remember a director once said that movies extend our lives three times. Maybe this is why I like movies and games.\n\nI don't want players to feel lost when playing my game because I always get lost in 3D linear games, so reasonable path planning is necessary.\n\nAs I sketched before, I hope that the player can see the main object as soon as he enters. Just like Mario wants to save the princess and Frodo wants to drop the ring, they both have a clear destination (the castle), so enlarging the main object in proportion is what I will do.\n\nWhen it comes to the design of the path, it can be a loop, a snake, a circle, or even a straight line, but I want it to be simple yet not simple, so maybe like the sketch I drew, I will put the main object in a higher position.\n\nFinally, let's talk about landmarks and navigation. To be honest, I don't want my 3D environment to have clumsy big red arrows. Even in the last century, those game makers would not do that. So I hope that my 3D environment has some vitality, so that players can feel the existence of wind, just like in Kurosawa's movies. And I can also use grass to avoid using roads, let grass grow on both sides and leave the middle empty. In this way, even without conspicuous road signs, we can know where the road is.\n\n。", "top": 0, "createdAt": 1726404902, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-09-15", "dateLabelColor": "#bc4c00"}, "P19": {"htmlDir": "docs/post/Homework Tasks - Week 8, Session 1.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 8, Session 1", "postUrl": "post/Homework%20Tasks%20-%20Week%208%2C%20Session%201.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/19", "commentNum": 0, "wordCount": 1956, "description": "Some sketches I drew about scenes from the movie Ran\n\n![image](https://github.com/user-attachments/assets/89d7c041-b058-43fc-abf1-0df16b9bfe34)\n\nIn fact, there is no strict standard or rule to define the quality of a scene. Most of the time, people only rely on their own vision, hearing, taste, smell and touch, which are the five senses. Of course, the five senses are felt in real life. When the scene is put on the screen, things will change, right? You can place different objects in an old house and reflect the changes when the player walks through different positions. You can also bring some tranquility to the players and the experiencer in the open fields or grasslands.\n\nThe sense of direction is innate to humans. Of course, this is also the judgment made by humans based on their understanding of the scene. So, as I just said, the meaning of the scene also affects the player's judgment. For example, when we are in the parking lot, our first goal when we enter is to find a parking space and find an empty space. When we want to leave the parking lot, we will look for the place where we came in (exit) again.\n\nSo what I have to do is not to do things that go against common sense, that is, to let players understand the sense of space of the scene at a glance. Light and shadow and size can all limit and define the scene, so place different objects around the main object or highlight it as the main object. I hope that the main object gives people a sense of being high above, so using the surrounding objects to set it off is also something I will do. In addition, we can also make some changes to the road, such as making the road from narrow to wide or adding some doors. Through the perspective of the door, you can also see the existence of the main object.\n\nI think I will try to follow the sketch I made earlier to create a sense of space.\n\n![image](https://github.com/user-attachments/assets/7067bf7d-7507-4d59-98a1-3b0df28fc3e3)。", "top": 0, "createdAt": 1726568555, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-09-17", "dateLabelColor": "#bc4c00"}, "P20": {"htmlDir": "docs/post/Homework Tasks - Week 8，Session2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 8，Session2", "postUrl": "post/Homework%20Tasks%20-%20Week%208%EF%BC%8CSession2.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/20", "commentNum": 0, "wordCount": 2194, "description": "Regarding music, I think music is of great significance to the 3D environment, which will make the scene less boring and more emotional.\n\nI added a song to the whole scene (Tsushima Suite: V. Seiiki). It's a good song that can show the mood. Because I think the way my transformation is presented is not these online models, but the different colors shown every time I pass through the scene, from black and white to a little red and then to color. For me, these may be more representative of my own transformation. The online models are more for the atmosphere of the whole scene.\n\nI hope that when the player's experience changes, it will also be accompanied by a transition in the music. So for me, this is a good song. I have tried playing it at a normal speed and it can match the beat.\n\nWhen I was writing this blog, I was actually thinking about the transformation expressed in the scene and my choice. I don’t think it was a bad choice. In fact, when I first went to university in Italy, I accidentally chose the film major. I thought it would be cool to be a director at the time, but I changed my major after a few days and then the matter was never resolved. So sometimes I wonder what I am doing if I am still studying film. So when it comes to transformation, other ideas have emerged in my mind, but the idea of ​​making a movie scene that I like and how its director changed my view of movies has not changed, so I did this. I always don’t know what to choose and what to do, or I am a person who has ideas in vain.\n\nBack to the point, just having a background music is not enough, so I also put some small sound effects on the torii to enhance the feeling of transformation. And I put different sounds of wind chimes and Buddhist bells in different torii, because the color tone of walking out of the torii is the same, and what it represents must be the same.\n\nFinally, I added some sound of running water beside the waterfall, because Kurosawa's films always have mountains, rivers, and clouds. I don't really want to add too much sound, because keeping it natural is also a way for me. Adding too much sound, if not controlled well, will make the scene noisy and disorderly🎶.。", "top": 0, "createdAt": 1726993688, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-09-22", "dateLabelColor": "#bc4c00"}, "P21": {"htmlDir": "docs/post/Homework Tasks - Week 9, Session 1.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 9, Session 1", "postUrl": "post/Homework%20Tasks%20-%20Week%209%2C%20Session%201.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/21", "commentNum": 0, "wordCount": 1777, "description": "Unfortunately, I was a bit slow and my file was a bit large. Unity Play supports a maximum of 200MB, so I recorded a screencast for my family.\n\nThey think the whole process went smoothly without any major problems. Of course, the whole environment is still far from good.\n\nThere are still many details to be adjusted, such as the interaction of objects. If possible, it would be better to make some enterable houses or buildings. The beauty of the model placement needs to be further improved. In addition, the ups and downs of the terrain in the whole scene can be made more exaggerated, such as cliffs, so that the scene will be more impactful. From the feedback\n\nFor me personally, I feel that I have not been able to do it at this stage and I feel regretful about it. Like I said before, I have always wanted to add a wind navigation. As long as I press a certain button, the wind will guide the direction, thereby driving the interaction of objects in the entire scene. Also, if the leaves are swaying in the wind while the wind is blowing, the scene will be taken to a higher level. There is another point that I have not done, which is the weather. At the beginning, I actually wanted to set it to rainy day at the beginning, but because of my ability, I was not able to realize it in the end. The last point is also a pity for me. I actually wanted to make some differences in the character animation at the beginning, middle and end. For example, at the beginning, it walks slower or even crawls forward, becomes faster in the middle but still slower, and finally there is a change in color and the character's footsteps become lighter. This is actually an effect I want to achieve, but unfortunately, at this stage, I am not capable enough to achieve such an effect.\n。", "top": 0, "createdAt": 1727866571, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-10-02", "dateLabelColor": "#bc4c00"}, "P22": {"htmlDir": "docs/post/Homework Tasks - Week 10, Session 1.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 10, Session 1", "postUrl": "post/Homework%20Tasks%20-%20Week%2010%2C%20Session%201.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/22", "commentNum": 0, "wordCount": 6700, "description": "Answer the self reflection questions \r\n\r\nAssignment 1 - Video Edit\r\n• How did you approach the relationship between the sonic and visual components of\r\nyour edit?\r\n\r\n• In videos, sound is used to provide emotions and make the audience feel present, such as the texture of some objects matching a video clip, such as what the sound of keys dropped on a table should be, and some L cuts and J cuts. When the video switches to a new scene, the audience already has an expectation of what is about to appear through the audio. J cuts help create a sense of anticipation and smoothly guide the audience from one scene to another. They are often used to introduce new characters or scenes. L cuts help maintain continuity between scenes and make transitions more natural. They are often used to keep the dialogue flowing or show what is mentioned in the dialogue.\r\n\r\n• How did you decide on the footage that you used to shape your project?\r\n\r\n• How to use video to create a self-portrait was a big problem for me at that time because I was no different from others, maybe there were some minor differences, so it was hard for me to figure out how to present my own uniqueness. I shot about 60 clips at that time. I really went to many places in those three weeks because I really didn’t know what to shoot, so I went out to look for it. My video clips might be when I was walking on the street and suddenly I thought of an idea and shot it. All my materials were shot in Melbourne. I think it was more like an adventure because I had just arrived here.\r\n\r\n• What did you learn about the power of sound to shape emotional experience, and how\r\ndid you apply this knowledge to your project?\r\n\r\n• Sound is an important factor in the video. I hope it is non-narrative but also can provide strength to the video. In my video, I use L cut and J cut as well as some daily sounds such as washing hands, washing dishes and opening doors to enhance the texture of life.\r\n\r\n\r\n• How does editing relate to the concepts of pacing and rhythm, and how did you use\r\nthese concepts to shape your use of time in the project?\r\n\r\n• Continuity is the most important thing for me in editing. I also hope to add some movement to the video through jump cuts. I put relatively static clips together, and put relatively large movements in the second half, and return to the quiet scene at the end.\r\n\r\n\r\n• Which parts of your personality, interests, past, and potential future did you choose to\r\ndepict in your portrait?\r\n\r\n• In my videos, I mainly depict my daily life, playing Go, cooking, and making mate tea. In the past, I wrote my name in a notebook and wrote my future expectations at the end. In terms of personality, I used the range of my movements to describe myself.\r\n\r\n\r\n• What were the primary aesthetic choices that you made to express those ideas in your\r\nwork?\r\n\r\n• Talking about the expression method, this really bothered me for a long time. I thought of many ways, such as expressing it in the third person, using my own shadow to express it, or even putting a paper bag on my head to express it. There are many more haha, but in the end I chose to focus on my own hands because we use our hands to do many things every day, just like typing my hands now, eating, making tea, and everything else. I watched some movies and drew how they depicted the feeling of hands. Unfortunately, because I was the only photographer, the effect was average. But I still like this concept very much. I think it can be used. Hands are a perfect representation of oneself.\r\n\r\nAssignment 2 - Graphic Icons\r\n• How would you summarise your idea behind the suite of icons, and why did you choose\r\nthe theme that you did?\n\n• The idea behind this set of icons I made was that I was trying to make an icon for a social application. The theme was system. I gave these icons a basic function and meaning, such as albums and contacts. I think the final effect is not bad. The reason why I chose this theme was actually mainly because of an article I read before about why there is no social application with all functions in Europe and the United States, like Instagram plus PayPal plus Twitter, so I wanted to try to make one.\n\n\r\n• Did you iterate through a series of approaches before settling on one? What changed\r\nacross those iterations, and why did you choose the one that you ended up with?\n\n• Yes, I have thought about making another theme icon before, similar to the game, but there are many points in it that are difficult for me to present now, and I am not proficient in the software, so I changed another method to draw the icon.\n\n\r\n• How did you translate your thumbnail sketches into the final flat designs in Illustrator?\r\nWas anything lost in that translation, or gained?\n\n• I started by looking at some designs by other people and some company proposals, blended them together, and drew sketches based on my own understanding. Then I tried different effects in illustrator and finally turned them into a set of icons without losing too much detail compared to the initial sketches.\n\n\r\n• How did you use colour to create a sense of unity and visual interest in the icons? Why\r\ndid you choose the palette that you did?\n\n• I used non-obtrusive colors, such as blue and green for functionality, red for prompts, and gray for systems. In addition, I referred to the products of mature commercial companies. Then I considered how to distribute the colors reasonably, and finally they became the colors of my icons.\n\n\r\n• How did the elements and principles of sound that you used in your audio design\r\ncorrespond to the elements and principles of design that you used in your visual design?\n\n• The process is actually quite similar to the video. Sound gives people a feeling. It is a way to provide emotional power and texture. So I hope to add some sounds that are not abrupt to give people a sense of texture and reality. Just like I added the sound of turning pages to the collection function, which is very common but rarely heard. At the same time, I also used some electronic sounds to simulate our daily reminders.\n\n\r\n• How did you translate the prompt that you chose from an abstract idea to a set of\r\nconcrete visual designs?\n\n• First, I need to thoroughly understand what this abstract idea means. Then I research related topics to find inspiration. This may include looking at similar designs, artwork, colors, shapes, and styles. Then I brainstorm to turn the abstract ideas into specific keywords or concepts. I draw preliminary sketches to turn the ideas into visual forms. At the same time, I think about how to convey emotions and information through these elements. Finally, I use software to create prototypes.\r\n。", "top": 0, "createdAt": 1728126768, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-10-05", "dateLabelColor": "#bc4c00"}, "P23": {"htmlDir": "docs/post/Homework Tasks - Week 10, Session 2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 10, Session 2", "postUrl": "post/Homework%20Tasks%20-%20Week%2010%2C%20Session%202.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/23", "commentNum": 0, "description": "", "wordCount": 0, "top": 0, "createdAt": 1728460621, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-10-09", "dateLabelColor": "#bc4c00"}, "P25": {"htmlDir": "docs/post/Homework Tasks - Week 11，Session 2.html", "labels": ["blog"], "postTitle": "Homework Tasks - Week 11，Session 2", "postUrl": "post/Homework%20Tasks%20-%20Week%2011%EF%BC%8CSession%202.html", "postSourceUrl": "https://github.com/yichiban1/yichiban.github.io/issues/25", "commentNum": 0, "description": "", "wordCount": 0, "top": 0, "createdAt": 1728906788, "style": "", "script": "", "head": "", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "createdDate": "2024-10-14", "dateLabelColor": "#bc4c00"}}, "singeListJson": {}, "labelColorDict": {"blog": "#0052cc", "bug": "#d73a4a", "documentation": "#0075ca", "duplicate": "#cfd3d7", "enhancement": "#a2eeef", "good first issue": "#7057ff", "help wanted": "#008672", "invalid": "#e4e669", "question": "#d876e3", "wontfix": "#ffffff"}, "displayTitle": "Yichiban's Go", "faviconUrl": "https://avatars.githubusercontent.com/u/160466378?v=4", "ogImage": "https://avatars.githubusercontent.com/u/160466378?v=4", "primerCSS": "<link href='https://mirrors.sustech.edu.cn/cdnjs/ajax/libs/Primer/21.0.7/primer.css' rel='stylesheet' />", "homeUrl": "https://yichiban1.github.io/yichiban.github.io", "prevUrl": "/index.html", "nextUrl": "disabled"}